#### Terraform Plan ✅
```
module.talos.talos_image_factory_schematic.this: Refreshing state... [id=d4cf8602b9d285ede53209d5e8c482372d61d3b9aa850736c2dc65bd8d091cba]
module.talos.talos_machine_secrets.machine_secrets: Refreshing state... [id=machine_secrets]
module.talos.data.talos_image_factory_urls.this: Reading...
module.talos.data.talos_image_factory_urls.this: Read complete after 0s
module.proxmox.proxmox_virtual_environment_download_file.talos_nocloud_image: Refreshing state... [id=local:iso/talos-v1.11.5-nocloud-amd64.img]
module.talos.data.talos_client_configuration.talosconfig: Reading...
module.talos.data.talos_machine_configuration.machineconfig_cp: Reading...
module.talos.data.talos_machine_configuration.machineconfig_worker: Reading...
module.talos.data.talos_client_configuration.talosconfig: Read complete after 0s [id=cluster01]
module.talos.data.talos_machine_configuration.machineconfig_worker: Read complete after 0s [id=cluster01]
module.talos.data.talos_machine_configuration.machineconfig_cp: Read complete after 0s [id=cluster01]
module.proxmox.proxmox_virtual_environment_vm.talos_cp["talos-cp-01"]: Refreshing state... [id=101]
module.proxmox.proxmox_virtual_environment_vm.talos_workers["talos-worker-01"]: Refreshing state... [id=102]
module.talos.talos_machine_configuration_apply.worker_config_apply[0]: Refreshing state... [id=machine_configuration_apply]
module.talos.talos_machine_configuration_apply.cp_config_apply[0]: Refreshing state... [id=machine_configuration_apply]
module.talos.talos_machine_bootstrap.bootstrap: Refreshing state... [id=machine_bootstrap]
module.talos.data.talos_cluster_health.health: Reading...
module.talos.data.talos_cluster_health.health: Read complete after 0s [id=cluster_health]
module.talos.talos_cluster_kubeconfig.kubeconfig: Refreshing state... [id=cluster01]
module.traefik.random_password.ubuntu_container_password: Refreshing state... [id=none]
module.traefik.tls_private_key.ubuntu_container_key: Refreshing state... [id=0940bdcfb1f2130a3129ccae2ec89db43fb78626]
module.traefik.proxmox_virtual_environment_download_file.latest_ubuntu_20_focal_lxc_img: Refreshing state... [id=local:vztmpl/ubuntu-20.04-standard_20.04-1_amd64.tar.gz]
module.proxmox_csi_plugin.proxmox_virtual_environment_role.csi: Refreshing state... [id=CSI]
module.proxmox_csi_plugin.helm_release.proxmox_csi_plugin: Refreshing state... [id=proxmox-csi-plugin]
module.sealed-secrets.helm_release.sealed_secrets: Refreshing state... [id=sealed-secrets-controller]
module.proxmox_csi_plugin.proxmox_virtual_environment_user.kubernetes-csi: Refreshing state... [id=kubernetes-csi@pve]
module.proxmox_csi_plugin.kubernetes_namespace.csi-proxmox: Refreshing state... [id=csi-proxmox]
module.monitoring.kubernetes_namespace.monitoring: Refreshing state... [id=monitoring]
module.proxmox_csi_plugin.proxmox_virtual_environment_user_token.kubernetes-csi-token: Refreshing state... [id=kubernetes-csi@pve!csi]
module.sealed-secrets.kubernetes_namespace.sealed-secrets: Refreshing state... [id=sealed-secrets]
module.traefik.proxmox_virtual_environment_container.traefik: Refreshing state... [id=108]
module.proxmox_csi_plugin.kubernetes_secret.proxmox-csi-plugin: Refreshing state... [id=csi-proxmox/proxmox-csi-plugin]
module.sealed-secrets.kubernetes_secret.sealed-secrets-key: Refreshing state... [id=sealed-secrets/sealed-secrets-bootstrap-key]
module.traefik.null_resource.traefik_config_sync: Refreshing state... [id=5270107476464041658]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.proxmox_csi_plugin.helm_release.proxmox_csi_plugin will be updated in-place
  ~ resource "helm_release" "proxmox_csi_plugin" {
      ~ id                         = "proxmox-csi-plugin" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v0.16.0" -> (known after apply)
          ~ chart          = "proxmox-csi-plugin" -> (known after apply)
          ~ first_deployed = 1765216215 -> (known after apply)
          ~ last_deployed  = 1765216215 -> (known after apply)
          ~ name           = "proxmox-csi-plugin" -> (known after apply)
          ~ namespace      = "csi-proxmox" -> (known after apply)
          + notes          = (known after apply)
          ~ revision       = 1 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - storageClass = [
                      - {
                          - cache         = "writethrough"
                          - fstype        = "ext4"
                          - mountOptions  = [
                              - "noatime",
                            ]
                          - name          = "proxmox-csi"
                          - reclaimPolicy = "Retain"
                          - ssd           = false
                          - storage       = "raid1"
                        },
                    ]
                }
            ) -> (known after apply)
          ~ version        = "0.5.1" -> (known after apply)
        } -> (known after apply)
        name                       = "proxmox-csi-plugin"
      ~ version                    = "0.5.1" -> "0.5.5"
        # (29 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
*Triggered by @renovate[bot]*